config/pen/documents/notes/ws/discipleship-group/weekly-journal/2024-week-4.tex
% Created 2024-01-26 Fri 19:07
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{root}
\date{\today}
\title{D-Group journal weekly entry for 2024, week 4}
\hypersetup{
 pdfauthor={root},
 pdftitle={D-Group journal weekly entry for 2024, week 4},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.1.50 (Org mode 9.6.8)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{D-Group weekly session notes}
\label{sec:org234777c}
Started working on it: \textit{<2024-01-26 Fri>}

Listen to instrumental worship music:
\href{https://www.youtube.com/watch?v=K5qgKMWbo4c\&t=1s\&ab\_channel=CHRISTIANPiano}{Wait On The Lord : Piano Instrumental Music With Scriptures \& Autumn Scene 🍁CHRISTIAN piano}

\begin{center}
\begin{tabular}{lll}
Scripture Memory & NT260 Passage & Foundations260 Readings\\[0pt]
\hline
 &  & \\[0pt]
\end{tabular}
\end{center}

While doing the reading, write bullet points about the story.
Take note of verses which stand out to me and think about what
the writer may have been experiencing when they wrote those verses.
Keep in mind the context of the verse.

\subsection{Readings bullet points}
\label{sec:orgca40e1d}
Write bullet points for each of the readings, and optionally sub-bullet-points applications for applying to or making comparisons to my own life.

Story bullet points (over entire Foundations260 reading):
\begin{itemize}
\item 
\end{itemize}

Story bullet points (over entire NT260 Journals reading):
\begin{itemize}
\item 
\end{itemize}

\subsection{Scripture memory}
\label{sec:org3a1d98b}
\begin{verbatim}
1  esv Matthew 5:7-8
\end{verbatim}

\subsection{HEAR Journals}
\label{sec:org00cd323}
Go over the reading and make hear journal entries for any verses
that stood out for me.

\begin{description}
\item[{H}] [h]ighlight a verse that stood out in the reading
\item[{E}] [e]xplain the context of the verse and what the writer/people in the story may have been experiencing when they wrote/experienced it
\item[{A}] write down how I can [a]pply this Bible verse in my own life
\item[{R}] [r]espond to the LORD in prayer
\end{description}

hear
\end{document}